# **Pandas Made Easy (the Guide)**

#### With many examples of some of the most used functions and methods.

**Contents:**

0. Import library
1. Import/export data
2. Display Data
3. Basic Info: a quick look at the data
4. Basic Statistics
5. Tweaking Data
6. Boolean indexing: loc
7. Boolean indexing: iloc
8. Basic Handling Data

We will be working on the ‘Titanic’ dataset for two main reasons: (1) most probably you are somehow already familiarized with it and (2) it’s very small, simple, and has (and has not) all the data we need for illustrating with examples.

The Titanic dataset is available for download [here](https://bit.ly/33tOJ2S).

---

# 0. Import library

For our purpose, ‘Pandas Library' is our weapon to get started.

In [2]:
import pandas as pd

# 1. Import/export data

**The ‘Titanic dataset’ is assigned as ‘data’** along with the notebook.

**a)** Import a csv file into the notebook using `read_csv`. You should add the type of separation of the data in the file.

In [6]:
data = pd.read_csv("titanic.csv", sep=',')

**b)** Read data from an Excel file using `read_excel`.

`data = pd.read_excel('file_name.xls')`

**c)** Export data frame to a csv file using `to_csv`.

`data.to_csv("file_name.csv", sep=';', index=False` # Coma separated and without index.  If None is given, header and index are True.

**d)** Export data frame to a excel file using `to_excel`.

`data.to_excel("file_name.xls´)`

# 2. Display data

Printing the first 'n' rows of the dataframe. If None is given, 5 rows are presented  by default.

In [7]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Printing the last 'n' rows of the dataframe. If None is given, 5 rows are presented by default.

In [9]:
data.tail(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

# 3. Basic info: a quick look at the data

**a)** Displaying the dimension of the data set: the total number of rows, columns.

In [10]:
data.shape

(891, 12)

**b)** Displaying the type of variables.

In [11]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

**c)** Displaying the type of variables by ordered values.

In [6]:
data.dtypes.sort_values(ascending=True)

PassengerId      int64
Survived         int64
Pclass           int64
SibSp            int64
Parch            int64
Age            float64
Fare           float64
Name            object
Sex             object
Ticket          object
Cabin           object
Embarked        object
dtype: object

**c)** Counting variables by type.

`data.dtypes.value_counts()`

In [7]:
data.dtypes.value_counts()

int64      5
object     5
float64    2
dtype: int64

What if...? ordered values.

`data.dtypes.value_counts(ascending=True)`

In [8]:
data.dtypes.value_counts(ascending=True)

float64    2
object     5
int64      5
dtype: int64

**d)** Checking balance between number of survivers vs non-survivers, in absolute values.

`data.Survived.value_counts()`

In [9]:
data.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

**What if...?** Checking the features' proportion, in percentage.

`data.Survived.value_counts() / data.Survived.value_counts().sum()`

...is the same as typing:

`data.Survived.value_counts(normalize=True)`

In [10]:
data.Survived.value_counts(normalize=True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

What if...? checking the features' proportion, in percentage and rounded by 4.

`data.Survived.value_counts(normalize=True).round(decimals=4) * 100`

In [11]:
data.Survived.value_counts(normalize=True).round(decimals=4) * 100

0    61.62
1    38.38
Name: Survived, dtype: float64

**e)** Displaying unique values of some feature

`data.Embarked.unique()`

In [12]:
data.Embarked.unique() # No matter how many times it repeates, the feature 'Embarked' has only 3 unique values

array(['S', 'C', 'Q', nan], dtype=object)

**f)** Counting how many unique values of some feature

`data.Sex.nunique() `

In [13]:
data.Sex.nunique() # The feature 'Sex' has only 2 classes: 'female' and 'male'

2

**g)** Evaluating the presence of missing values in the dataset?

`data.isnull().values.any()`

In [14]:
data.isnull().values.any()

True

**h)** Displaying the number of missing values by variable using `isnull()`.

`data.isnull().sum()`

In [15]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

What if...? number of existing values? using `notnull()`.

`data.notnull().sum()`

In [16]:
data["Age"].isnull().sum()

177

In [17]:
data.notnull().sum()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

**i)** Displaying the percentage (%) of missing values by variable.

`data.isnull().sum() / data.isnull().shape[0] * 100`

... is the same as:

`data.isnull().mean() * 100`

In [18]:
data.isnull().sum() / data.isnull().shape[0] * 100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

What if...? rounding decimals? (2 in the example below).

`(data.isnull().sum() / data.isnull().shape[0] * 100).round(decimals=2)`

... is the same as:

`(data.isnull().mean() * 100).round(decimals=2)`

In [19]:
(data.isnull().sum() / data.isnull().shape[0] * 100).round(decimals=2)

PassengerId     0.00
Survived        0.00
Pclass          0.00
Name            0.00
Sex             0.00
Age            19.87
SibSp           0.00
Parch           0.00
Ticket          0.00
Fare            0.00
Cabin          77.10
Embarked        0.22
dtype: float64

Bonus: printing the answers using combined text.

`print("The percentage of 'Age' is missing values:", (data.Age.isnull().sum() / data.Age.isnull().shape[0] * 100).round(decimals=2), "%")`

In [20]:
print("The percentage of 'Age' is missing values:", (data.Age.isnull().sum() / data.Age.isnull().shape[0] * 100).round(decimals=2), "%")

The percentage of 'Age' is missing values: 19.87 %

`print(f"The feature 'Age' has {data.Age.isnull().sum()} missing values")`

In [21]:
print(f"The feature 'Age' has {data.Age.isnull().sum()} missing values")

The feature 'Age' has 177 missing values

`print("'Age' has {} and 'Cabin' has {} missing values!".format(data.Age.isnull().sum(), data.Cabin.isnull().sum()))`

In [22]:
print("'Age' has {} and 'Cabin' has {} missing values!".format(data.Age.isnull().sum(), data.Cabin.isnull().sum()))

'Age' has 177 and 'Cabin' has 687 missing values!

`print(f"The sum of the missing values of both 'Age' and 'Cabin' is {data.Age.isnull().sum() + data.Cabin.isnull().sum()}")`

In [23]:
print(f"The sum of the missing values of both 'Age' and 'Cabin' is {data.Age.isnull().sum() + data.Cabin.isnull().sum()}")

The sum of the missing values of both 'Age' and 'Cabin' is 864

**j)** General **overview** of shape, variables' type and missing values.

`data.info()`

In [24]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

What if...? general overview of **specific features** ('Sex' and 'Age' in the example below).

`data[['Sex','Age']].info()`

In [25]:
data[['Sex','Age']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sex     891 non-null    object
 1   Age     714 non-null    float64
dtypes: float64(1), object(1)
memory usage: 14.0+ KB

# 4. Basic statistics

**a)** The `describe` method gives us only basic statistics about the data. By default, it will only calculate stats for numeric data. The result is represented as a pandas DataFrame.

`data.describe()`

In [26]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

What if...? for adding other non-standard values for instance, the 'variance'.

`describe = data.describe()`

`describe.append(pd.Series(data.var(), name='variance'))`

In [27]:
describe = data.describe()
describe.append(pd.Series(data.var(), name='variance'))

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200
variance,66231.000000,0.236772,0.699015,211.019125,1.216043,0.649728,2469.436846

**b)** Displaying categorical data.

`data.describe(include=["O"])`

... is the same as typing:

`data.describe(exclude=['float64','int64'])`

... and is also the same as typing:

`data.describe(include=[np.object])`

In [28]:
data.describe(include=["O"])

                Name   Sex Ticket        Cabin Embarked
count            891   891    891          204      889
unique           891     2    681          147        3
top     Lam, Mr. Len  male   1601  C23 C25 C27        S
freq               1   577      7            4      644

**c)** By passing the parameter `include='all'`, will display all data (noth numeric and non-numeric).

`data.describe(include='all')`

In [29]:
data.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Lam, Mr. Len",male,NaN,NaN,NaN,1601,NaN,C23 C25 C27,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

**d)** Do not forget... to transpose the dataframe by adding the `.T` at the end. This is also a very useful resource appliable in every dataframe.

`data.describe(include='all').T`

In [30]:
data.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
PassengerId,891,NaN,NaN,NaN,446,257.354,1,223.5,446,668.5,891
Survived,891,NaN,NaN,NaN,0.383838,0.486592,0,0,0,1,1
Pclass,891,NaN,NaN,NaN,2.30864,0.836071,1,2,3,3,3
Name,891,891,"Lam, Mr. Len",1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Sex,891,2,male,577,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,714,NaN,NaN,NaN,29.6991,14.5265,0.42,20.125,28,38,80
SibSp,891,NaN,NaN,NaN,0.523008,1.10274,0,0,0,1,8
Parch,891,NaN,NaN,NaN,0.381594,0.806057,0,0,0,0,6
Ticket,891,681,1601,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Fare,891,NaN,NaN,NaN,32.2042,49.6934,0,7.9104,14.4542,31,512.329
Cabin,204,147,C23 C25 C27,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Embarked,889,3,S,644,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**e)** Calculus of percentiles 1%, 5%, 95%, 99%. As expected, it will only calculate stats for numeric data.

`data.quantile(q=[.01, .05, .95, .99])`

In [31]:
data.quantile(q=[.01, .05, .95, .99])

      PassengerId  Survived  Pclass    Age  SibSp  Parch       Fare
0.01          9.9       0.0     1.0   1.00    0.0    0.0    0.00000
0.05         45.5       0.0     1.0   4.00    0.0    0.0    7.22500
0.95        846.5       1.0     3.0  56.00    3.0    2.0  112.07915
0.99        882.1       1.0     3.0  65.87    5.0    4.0  249.00622

**f)** Summary Stats

- Displaying unique values of some feature

`data.Embarked.unique()`

In [32]:
display(data.Embarked.unique())
display(data.Sex.nunique())

array(['S', 'C', 'Q', nan], dtype=object)

2

- Counting total of unique values of some feature

`data.Sex.nunique()`

In [33]:
data.Sex.nunique()

2

- Counting total values of both dataset and some feature

`data.count()`

In [34]:
data.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

- Highest value of some feature

`data.Age.max()`

In [35]:
data.Age.max()

80.0

- Lowest value of some feature

`data.Age.min()`

In [36]:
data.Age.min()

0.42

- Some feature's mean value (average)

`data.Age.mean()`

In [37]:
data.Age.mean()

29.69911764705882

- Some feature's median value

`data.Age.median()`

In [38]:
data.Age.median()

28.0

- 99th quantile of some feature

`data.Age.quantile(q=[.99])`

In [39]:
data.Age.quantile(q=[.99])

0.99    65.87
Name: Age, dtype: float64

- Some feature's standard deviation

`data.Age.std()`

In [40]:
data.Age.std()

14.526497332334044

- Some feature's variance

`data.Age.var()`

In [41]:
data.Age.var()

211.0191247463081

**g)** Bonus...

Showing the 2 most frequent uniques of the categorical feature 'Embarked'

`data['Embarked'].value_counts().head(2)`

In [42]:
data['Embarked'].value_counts().head(2)

S    644
C    168
Name: Embarked, dtype: int64

What is the percentage of 'Embarked' highest unique? (fraction of the most common unique in regards to all the others)

`top_unique = data['Embarked'].value_counts(normalize=True)[0]`

`print(f'{top_unique:.1%}')`

In [43]:
top_unique = data['Embarked'].value_counts(normalize=True)[0]

print(f'{top_unique:.2%}')

72.44%

**h) Correlations** between variables. As expected, it will only display stats for numeric data.

`data.corr()` # Pearson's correlation by default

In [44]:
data.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

What if...? displaying correlation between a chosen variable ('Survived' in the below example) and the others.

`correlation = data.corr()`

`correlation.Survived.sort_values().sort_values(ascending=False)` # ordered values

In [45]:
correlation = data.corr()
correlation.Survived.sort_values().sort_values(ascending=False) # ordered values

Survived       1.000000
Fare           0.257307
Parch          0.081629
PassengerId   -0.005007
SibSp         -0.035322
Age           -0.077221
Pclass        -0.338481
Name: Survived, dtype: float64

# 5. Tweaking Data

In [46]:
data = pd.read_csv("titanic.csv", sep=",")

a) List the columns' names.

`data.columns`

In [47]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

b) Rename a column.

`data.rename(columns = {data.columns[0]:'id'}, inplace=True)`

In [48]:
data.rename(columns = {data.columns[0]:'id'}, inplace=True)

`data.rename(columns = {'PassengerId':'id'}, inplace=True)`

In [49]:
data.rename(columns = {'PassengerId':'id'}, inplace=True)

In [50]:
data.columns

Index(['id', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

c) Rename several columns.

`data.rename(columns={'PassengerId':'Passenger_Id','Pclass':'P_Class','SibSp':'Sib_Sp'}, inplace=True)`

In [51]:
data.rename(columns={'PassengerId':'Passenger_Id','Pclass':'P_Class','SibSp':'Sib_Sp'}, inplace=True)

In [52]:
data.columns

Index(['id', 'Survived', 'P_Class', 'Name', 'Sex', 'Age', 'Sib_Sp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

d) Replacing underscores by dots through a list comprehension.

`data.columns = [x.replace('_', '.') for x in data.columns]`

In [53]:
data.columns = [x.replace('_', '.') for x in data.columns]

In [54]:
data.columns

Index(['id', 'Survived', 'P.Class', 'Name', 'Sex', 'Age', 'Sib.Sp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

e) Lowering upper letters and removing the dots.

`data.columns = [x.lower().replace('.', '') for x in data.columns]`

In [55]:
data.columns = [x.lower().replace('.', '') for x in data.columns]

In [56]:
data.columns

Index(['id', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked'],
      dtype='object')

f) Capitalizing the columns names.

`data.columns = [x.capitalize() for x in data.columns]`

In [57]:
data.columns = [x.capitalize() for x in data.columns]

In [58]:
data.columns

Index(['Id', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Sibsp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

# 6. Boolean indexing: **loc**

`data.loc[<lines>, <columns>]`

a) Selecting a row.

`data.loc[[3]]`

In [59]:
data.loc[[3]]

,Id,Survived,Pclass,Name,Sex,Age,Sibsp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1,C123,S

b) Selecting an array of rows.

`data.loc[6:8]`

In [60]:
data.loc[6:8]

,Id,Survived,Pclass,Name,Sex,Age,Sibsp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S

c) Selecting several rows.

`data.loc[[7,28,39]]`

In [61]:
data.loc[[7,28,39]]

,Id,Survived,Pclass,Name,Sex,Age,Sibsp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C

d) Selecting a row from the columns 'Name, 'Age', 'Sex' and 'Survived'.

`data.loc[[7], ['Name', 'Age', 'Sex', 'Survived']]`

In [62]:
data.loc[[7], ['Name','Age', 'Sex', 'Survived']]

                             Name  Age   Sex  Survived
7  Palsson, Master. Gosta Leonard  2.0  male         0

e) Selecting many rows from several columns.

`data.loc[[7,28,39], ['Name', 'Age', 'Sex','Survived']]`

In [63]:
data.loc[[7,28,39], ['Name', 'Age', 'Sex', 'Survived']]

                              Name   Age     Sex  Survived
7   Palsson, Master. Gosta Leonard   2.0    male         0
28   O'Dwyer, Miss. Ellen "Nellie"   NaN  female         1
39     Nicola-Yarred, Miss. Jamila  14.0  female         1

f) Selecting specific values under some condition using `loc`. In this case, from rows 4 to 10 select passengers older or equal to 10 years old.

`data.loc[4:10, ['Age']] >= 10`

In [64]:
data.loc[4:10, ['Age']] >= 10

      Age
4    True
5   False
6    True
7   False
8    True
9    True
10  False

g) Selecting specific values under some condition using `loc`. In this case, from the first 5 rows select passengers who traveled in Cabin C123.

`data.loc[:4, ['Cabin']] == 'C123'`

In [65]:
data.loc[:4, ['Cabin']] == 'C123'

   Cabin
0  False
1  False
2  False
3   True
4  False

# 7. Boolean indexing: iloc

`data.iloc[<lines>, <columns>]` # Selecting by number

a) Selecting the first row of the dataset.

`data.iloc[3]`

In [66]:
data.iloc[3]

Id                                                     4
Survived                                               1
Pclass                                                 1
Name        Futrelle, Mrs. Jacques Heath (Lily May Peel)
Sex                                               female
Age                                                   35
Sibsp                                                  1
Parch                                                  0
Ticket                                            113803
Fare                                                53.1
Cabin                                               C123
Embarked                                               S
Name: 3, dtype: object

b) Selecting an array of rows from all the columns.

`data.iloc[6:12]`

In [67]:
data.iloc[6:12]

,Id,Survived,Pclass,Name,Sex,Age,Sibsp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

c) Selecting several rows from all the columns.

`data.iloc[[7,28,39],:]`

In [68]:
data.iloc[[7,28,39],:]

,Id,Survived,Pclass,Name,Sex,Age,Sibsp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C

d) Selecting a row from the columns 'Name, 'Age', 'Sex' and 'Survived'.

`data.iloc[[7], [3,5,4,1]]`

In [69]:
data.iloc[[7], [3,5,4,1]]

                             Name  Age   Sex  Survived
7  Palsson, Master. Gosta Leonard  2.0  male         0

e) Selecting many rows from several columns.

`data.iloc[[7,28,39], [3,5,4,1]]`

In [70]:
data.iloc[[7,28,39], [3,5,4,1]]

                              Name   Age     Sex  Survived
7   Palsson, Master. Gosta Leonard   2.0    male         0
28   O'Dwyer, Miss. Ellen "Nellie"   NaN  female         1
39     Nicola-Yarred, Miss. Jamila  14.0  female         1

f) Selecting many rows form a sequence of columns.

`data.iloc[[7,28,39], 3:10]`

In [71]:
data.iloc[[7,28,39], 3:10]

,Name,Sex,Age,Sibsp,Parch,Ticket,Fare
7,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750
28,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792
39,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417

g) Selecting specific values

`data.iloc[6:13, -1]` # from rows 6 to 12, last column

`data.iloc[:, [3,6]]` # all rows from 3rd and 6th columns

`data.iloc[[7,28,39], 3:7]` # 7, 28, 39 rows from the 3rd to 6th columns

`data.iloc[-20:, -1:]`# last 20 rows from the last column

# 8. Basic Handling Data

In [122]:
data = pd.read_csv("titanic.csv", sep=",")

Axis = 0 referes to rows and Axis = 1 referes to columns

a) Removing missing values (nan)

`data.isnull().values.any()`

In [85]:
data.isnull().values.any()

True

`data.dropna(axis=0, inplace=True)`

In [86]:
data.dropna(axis=0, inplace=True)

`data.isnull().values.any()`

In [87]:
data.isnull().values.any()

False

b) Removing columns

`data.drop(columns=['PassengerId', 'Name'], axis=1).head()`

In [79]:
data.drop(columns=['PassengerId', 'Name'], axis=1).head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S

c) Value counts can also display NaN values

`data.Age.value_counts(dropna=False)`

In [102]:
data.Age.value_counts(dropna=False)

NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
66.00      1
23.50      1
0.42       1
Name: Age, Length: 89, dtype: int64

d) Replacing missing values (step-by-step)

- Creating a new dataframe, copy of data

`new_df = data.copy()`

In [129]:
new_df = data.copy()

- Filling any NAN with the mean of data.Age and assigning the result to a new column

`new_df.Age.mean()` # The mean (average) value of data.Age

In [137]:
new_df.Age.mean()

29.69911764705882

`new_df['Age_mean'] = new_df.Age.fillna(new_df.Age.mean())`

In [130]:
new_df['Age_mean'] = new_df.Age.fillna(new_df.Age.mean())

- Filling any NAN with the median of data.Age and assigning the result to a new column

`new_df.Age.median()` # The median value of data.Age

In [138]:
new_df.Age.median()

28.0

`new_df['Age_median'] = new_df.Age.fillna(new_df.Age.median())`

In [131]:
new_df['Age_median'] = new_df.Age.fillna(new_df.Age.median())

- Validating results

`new_df[['Age', 'Age_mean', 'Age_median']].isnull().sum()`

In [132]:
new_df[['Age', 'Age_mean', 'Age_median']].isnull().sum()

Age           177
Age_mean        0
Age_median      0
dtype: int64

`new_df[['Age', 'Age_mean', 'Age_median']][106:110]` # Displaying rows 106 to 110 to verify two NAN examples' imputation

In [144]:
new_df[['Age', 'Age_mean', 'Age_median']][106:110] # Displaying rows 106 to 110 to verify two NAN examples' imputation

      Age   Age_mean  Age_median
106  21.0  21.000000        21.0
107   NaN  29.699118        28.0
108  38.0  38.000000        38.0
109   NaN  29.699118        28.0

---

Author: Gonçalo Guimarães Gomes